Revit 2024 API
AutomaticConnectionBehaviorType Enumeration
 Defines behavior of connector with respect to automatic creation of connections
 Enumeration of automatic connection behavior types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum AutomaticConnectionBehaviorType
Visual Basic
Public Enumeration AutomaticConnectionBehaviorType
Visual C++
public enum class AutomaticConnectionBehaviorType
Members
Member name | Description
Exclude |  Connector does not participate in automatic connection
Active |  Connector is actively looking to be connected
Forced |  Connector must establish a connection
Accepting |  Connector accepts more automatic connections if needed, but
Full |  Connector may participate in automatic connection, but at the moment it is fully connected
See Also
Autodesk.Revit.DB Namespace